nxp-mcuxpresso/mcuxsdk-examples/_boards/lpcxpresso55s16/common/pin_mux/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: LPC55S16
package_id: LPC55S16JBD100
mcu_data: ksdk2_0
processor_version: 0.15.6
board: LPCXpresso55S16
expansion_headers:
- id: lpc_style_arduino_mirror
  name: 'LPCXpressoV2/V3 Expansion Header '
  connectors:
  - id: C1
    name: J10
    pins:
    - {id: 6, pin_num: '12', pin_signal: PIO0_12/FC3_TXD_SCL_MISO_WS/FREQME_GPIO_CLK_B/SCT_GPI7/SWDIO/FC6_TXD_SCL_MISO_WS/SECURE_GPIO0_12/ADC0_10}
    - {id: 7, name: IOREF, external_signal_types: power_supply_3.3V}
    - {id: 8, pin_num: '13', pin_signal: PIO0_11/FC6_RXD_SDA_MOSI_DATA/CTIMER2_MAT2/FREQME_GPIO_CLK_A/SWCLK/SECURE_GPIO0_11/ADC0_9}
    - {id: 9, name: RESET, pin_num: '32', pin_signal: RESETN}
    - {id: 10, pin_num: '32', pin_signal: RESETN}
    - {id: 11, name: 3V3, external_signal_types: power_supply_3.3V}
    - {id: 13, name: 5V0, external_signal_types: power_supply_5V}
    - {id: 14, pin_num: '89', pin_signal: PIO0_6/FC3_SCK/CT_INP13/CTIMER4_MAT0/SCT_GPI6/SECURE_GPIO0_6}
    - {id: 15, name: GND, external_signal_types: ground}
    - {id: 16, pin_num: '86', pin_signal: PIO0_4/CAN0_RD/FC4_SCK/CT_INP12/SCT_GPI4/FC3_CTS_SDA_SSEL0/SECURE_GPIO0_4}
    - {id: 17, name: GND, external_signal_types: ground}
    - {id: 18, pin_num: '83', pin_signal: PIO0_3/FC3_RXD_SDA_MOSI_DATA/CTIMER0_MAT1/SCT0_OUT1/SCT_GPI3/SECURE_GPIO0_3}
    - {id: 19, name: VIN, external_signal_types: power_supply_5V}
    - {id: 20, pin_num: '81', pin_signal: PIO0_2/FC3_TXD_SCL_MISO_WS/CT_INP1/SCT0_OUT0/SCT_GPI2/SECURE_GPIO0_2}
  - id: C2
    name: J9
    pins:
    - {id: 1, pin_num: '21', pin_signal: PIO0_10/FC6_SCK/CT_INP10/CTIMER2_MAT0/FC1_TXD_SCL_MISO_WS/SCT0_OUT2/SWO/SECURE_GPIO0_10/ADC0_1}
    - {id: 2, name: D15, pin_num: '4', pin_signal: PIO1_20/FC7_RTS_SCL_SSEL1/CT_INP14/FC4_TXD_SCL_MISO_WS/PLU_OUT2}
    - {id: 3, pin_num: '85', pin_signal: PIO1_27/FC2_RTS_SCL_SSEL1/CTIMER0_MAT3/CLKOUT/PLU_IN4/CAN0_TD}
    - {id: 4, name: D14, pin_num: '30', pin_signal: PIO1_21/FC7_CTS_SDA_SSEL0/CTIMER3_MAT2/FC4_RXD_SDA_MOSI_DATA/PLU_OUT3}
    - {id: 5, pin_num: '93', pin_signal: PIO1_11/FC1_TXD_SCL_MISO_WS/CT_INP5/USB0_VBUS}
    - {id: 6, name: AREF, external_signal_types: power_supply_3.3V}
    - {id: 7, pin_num: '88', pin_signal: PIO0_5/CAN0_TD/FC4_RXD_SDA_MOSI_DATA/CTIMER3_MAT0/SCT_GPI5/FC3_RTS_SCL_SSEL1/MCLK/SECURE_GPIO0_5}
    - {id: 8, name: GND, external_signal_types: ground}
    - {id: 9, pin_num: '74', pin_signal: PIO0_20/FC3_CTS_SDA_SSEL0/CTIMER1_MAT1/CT_INP15/SCT_GPI2/FC7_RXD_SDA_MOSI_DATA/HS_SPI_SSEL0/PLU_IN5/SECURE_GPIO0_20/FC4_TXD_SCL_MISO_WS}
    - {id: 10, name: D13, pin_num: '61', pin_signal: PIO1_2/CAN0_TD/CTIMER0_MAT3/SCT_GPI6/HS_SPI_SCK/USB1_PORTPWRN/PLU_OUT5}
    - {id: 11, pin_num: '90', pin_signal: PIO0_19/FC4_RTS_SCL_SSEL1/UTICK_CAP0/CTIMER0_MAT2/SCT0_OUT2/FC7_TXD_SCL_MISO_WS/PLU_IN4/SECURE_GPIO0_19}
    - {id: 12, name: D12, pin_num: '62', pin_signal: PIO1_3/CAN0_RD/SCT0_OUT4/HS_SPI_MISO/USB0_PORTPWRN/PLU_OUT6}
    - {id: 13, pin_num: '76', pin_signal: PIO0_21/FC3_RTS_SCL_SSEL1/UTICK_CAP3/CTIMER3_MAT3/SCT_GPI3/FC7_SCK/HS_SPI_SSEL3/PLU_CLKIN/SECURE_GPIO0_21}
    - {id: 14, name: D11, pin_num: '60', pin_signal: PIO0_26/FC2_RXD_SDA_MOSI_DATA/CLKOUT/CT_INP14/SCT0_OUT5/USB0_IDVALUE/FC0_SCK/HS_SPI_MOSI/SECURE_GPIO0_26}
    - {id: 15, pin_num: '77', pin_signal: PIO1_25/FC2_TXD_SCL_MISO_WS/SCT0_OUT2/UTICK_CAP0/PLU_CLKIN}
    - {id: 16, name: D10, pin_num: '59', pin_signal: PIO1_1/FC3_RXD_SDA_MOSI_DATA/CT_INP3/SCT_GPI5/HS_SPI_SSEL1/USB1_OVERCURRENTN/PLU_OUT4}
    - {id: 17, pin_num: '73', pin_signal: PIO1_28/FC7_SCK/CT_INP2/PLU_IN3}
    - {id: 18, name: D9, pin_num: '31', pin_signal: PIO1_5/FC0_RXD_SDA_MOSI_DATA/CTIMER2_MAT0/SCT_GPI0}
    - {id: 19, pin_num: '2', pin_signal: PIO1_13/FC6_RXD_SDA_MOSI_DATA/CT_INP6/USB0_OVERCURRENTN/USB0_FRAME}
    - {id: 20, name: D8, pin_num: '24', pin_signal: PIO1_8/FC0_CTS_SDA_SSEL0/SCT0_OUT1/FC4_SSEL2/ADC0_4}
  - id: C3
    name: J12
    pins:
    - {id: 1, pin_num: '7', pin_signal: PIO0_1/FC3_CTS_SDA_SSEL0/CT_INP0/SCT_GPI1/CMP0_OUT/SECURE_GPIO0_1}
    - {id: 2, name: D7, pin_num: '10', pin_signal: PIO1_9/FC1_SCK/CT_INP4/SCT0_OUT2/FC4_CTS_SDA_SSEL0/ADC0_12}
    - {id: 3, pin_num: '57', pin_signal: PIO1_14/UTICK_CAP2/CTIMER1_MAT2/FC5_CTS_SDA_SSEL0/USB0_LEDN/ACMP0_D}
    - {id: 4, name: D6, pin_num: '40', pin_signal: PIO1_10/FC1_RXD_SDA_MOSI_DATA/CTIMER1_MAT0/SCT0_OUT3}
    - {id: 5, pin_num: '77', pin_signal: PIO1_25/FC2_TXD_SCL_MISO_WS/SCT0_OUT2/UTICK_CAP0/PLU_CLKIN}
    - {id: 6, name: D5, pin_num: '1', pin_signal: PIO1_4/FC0_SCK/CTIMER2_MAT1/SCT0_OUT0/FREQME_GPIO_CLK_A}
    - {id: 7, pin_num: '42', pin_signal: PIO1_23/FC2_SCK/SCT0_OUT0/FC3_SSEL2/PLU_OUT5}
    - {id: 8, name: D4, pin_num: '9', pin_signal: PIO1_7/FC0_RTS_SCL_SSEL1/CTIMER2_MAT2/SCT_GPI4}
    - {id: 9, pin_num: '3', pin_signal: PIO1_24/FC2_RXD_SDA_MOSI_DATA/SCT0_OUT1/FC3_SSEL3/PLU_OUT6}
    - {id: 10, name: D3, pin_num: '5', pin_signal: PIO1_6/FC0_TXD_SCL_MISO_WS/CTIMER2_MAT1/SCT_GPI3}
    - {id: 11, pin_num: '82', pin_signal: PIO1_15/UTICK_CAP3/CT_INP7/FC5_RTS_SCL_SSEL1/FC4_RTS_SCL_SSEL1}
    - {id: 12, name: D2, pin_num: '22', pin_signal: PIO0_15/FC6_CTS_SDA_SSEL0/UTICK_CAP2/CT_INP16/SCT0_OUT2/SECURE_GPIO0_15/ADC0_2}
    - {id: 13, pin_num: '68', pin_signal: PIO1_26/FC2_CTS_SDA_SSEL0/SCT0_OUT3/CT_INP3/UTICK_CAP1/HS_SPI_SSEL3/PLU_IN5}
    - {id: 14, name: D1, pin_num: '27', pin_signal: PIO0_27/FC2_TXD_SCL_MISO_WS/CTIMER3_MAT2/SCT0_OUT6/FC7_RXD_SDA_MOSI_DATA/PLU_OUT0/SECURE_GPIO0_27}
    - {id: 15, pin_num: '64', pin_signal: PIO1_18/SCT0_OUT5/PLU_OUT0}
    - {id: 16, name: D0, pin_num: '3', pin_signal: PIO1_24/FC2_RXD_SDA_MOSI_DATA/SCT0_OUT1/FC3_SSEL3/PLU_OUT6}
    - {id: 17, pin_num: '68', pin_signal: PIO1_26/FC2_CTS_SDA_SSEL0/SCT0_OUT3/CT_INP3/UTICK_CAP1/HS_SPI_SSEL3/PLU_IN5}
    - {id: 18, pin_num: '87', pin_signal: PIO1_16/FC6_TXD_SCL_MISO_WS/CTIMER1_MAT3}
    - {id: 19, pin_num: '56', pin_signal: PIO0_18/FC4_CTS_SDA_SSEL0/CTIMER1_MAT0/SCT0_OUT1/PLU_IN3/SECURE_GPIO0_18/ACMP0_C}
    - {id: 20, pin_num: '43', pin_signal: PIO1_17/FC6_RTS_SCL_SSEL1/SCT0_OUT4}
  - id: C4
    name: J13
    pins:
    - {id: 1, name: A0, pin_num: '14', pin_signal: PIO0_16/FC4_TXD_SCL_MISO_WS/CLKOUT/CT_INP4/SECURE_GPIO0_16/ADC0_8}
    - {id: 2, pin_num: '43', pin_signal: PIO1_17/FC6_RTS_SCL_SSEL1/SCT0_OUT4}
    - {id: 3, name: A1, pin_num: '20', pin_signal: PIO0_23/MCLK/CTIMER1_MAT2/CTIMER3_MAT3/SCT0_OUT4/FC0_CTS_SDA_SSEL0/SECURE_GPIO0_23/ADC0_0}
    - {id: 4, pin_num: '87', pin_signal: PIO1_16/FC6_TXD_SCL_MISO_WS/CTIMER1_MAT3}
    - {id: 5, name: A2, pin_num: '54', pin_signal: PIO0_0/FC3_SCK/CTIMER0_MAT0/SCT_GPI0/SECURE_GPIO0_0/ACMP0_A}
    - {id: 6, pin_num: '41', pin_signal: PIO1_22/CTIMER2_MAT3/SCT_GPI5/FC4_SSEL3/PLU_OUT4/CAN0_RD}
    - {id: 7, name: A3, pin_num: '91', pin_signal: PIO1_31/MCLK/CTIMER0_MAT2/SCT0_OUT6/PLU_IN0}
    - {id: 8, pin_num: '91', pin_signal: PIO1_31/MCLK/CTIMER0_MAT2/SCT0_OUT6/PLU_IN0}
    - {id: 9, name: A4, pin_num: '71', pin_signal: PIO0_13/FC1_CTS_SDA_SSEL0/UTICK_CAP0/CT_INP0/SCT_GPI0/FC1_RXD_SDA_MOSI_DATA/PLU_IN0/SECURE_GPIO0_13}
    - {id: 10, pin_num: '71', pin_signal: PIO0_13/FC1_CTS_SDA_SSEL0/UTICK_CAP0/CT_INP0/SCT_GPI0/FC1_RXD_SDA_MOSI_DATA/PLU_IN0/SECURE_GPIO0_13}
    - {id: 11, name: A5, pin_num: '72', pin_signal: PIO0_14/FC1_RTS_SCL_SSEL1/UTICK_CAP1/CT_INP1/SCT_GPI1/FC1_TXD_SCL_MISO_WS/PLU_IN1/SECURE_GPIO0_14}
    - {id: 12, pin_num: '72', pin_signal: PIO0_14/FC1_RTS_SCL_SSEL1/UTICK_CAP1/CT_INP1/SCT_GPI1/FC1_TXD_SCL_MISO_WS/PLU_IN1/SECURE_GPIO0_14}
- id: pmod
  name: Pmod(TM)
  connectors:
  - id: C1
    name: J18
    pins:
    - {id: 1, name: P1, pin_num: '86', pin_signal: PIO0_4/CAN0_RD/FC4_SCK/CT_INP12/SCT_GPI4/FC3_CTS_SDA_SSEL0/SECURE_GPIO0_4}
    - {id: 2, name: P7, pin_num: '73', pin_signal: PIO1_28/FC7_SCK/CT_INP2/PLU_IN3}
    - {id: 3, name: P2, pin_num: '83', pin_signal: PIO0_3/FC3_RXD_SDA_MOSI_DATA/CTIMER0_MAT1/SCT0_OUT1/SCT_GPI3/SECURE_GPIO0_3}
    - {id: 4, name: P8, pin_num: '58', pin_signal: PIO1_19/SCT0_OUT7/CTIMER3_MAT1/SCT_GPI7/FC4_SCK/PLU_OUT1/ACMPVREF}
    - {id: 5, name: P3, pin_num: '81', pin_signal: PIO0_2/FC3_TXD_SCL_MISO_WS/CT_INP1/SCT0_OUT0/SCT_GPI2/SECURE_GPIO0_2}
    - {id: 6, name: P9, pin_num: '72', pin_signal: PIO0_14/FC1_RTS_SCL_SSEL1/UTICK_CAP1/CT_INP1/SCT_GPI1/FC1_TXD_SCL_MISO_WS/PLU_IN1/SECURE_GPIO0_14}
    - {id: 7, name: P4, pin_num: '89', pin_signal: PIO0_6/FC3_SCK/CT_INP13/CTIMER4_MAT0/SCT_GPI6/SECURE_GPIO0_6}
    - {id: 8, name: P10, pin_num: '71', pin_signal: PIO0_13/FC1_CTS_SDA_SSEL0/UTICK_CAP0/CT_INP0/SCT_GPI0/FC1_RXD_SDA_MOSI_DATA/PLU_IN0/SECURE_GPIO0_13}
    - {id: 9, name: GND, external_signal_types: ground}
    - {id: 10, name: GND, external_signal_types: ground}
    - {id: 11, name: VCC, external_signal_types: power_supply_3.3V}
    - {id: 12, name: VCC, external_signal_types: power_supply_3.3V}
- id: micro_bus
  name: mikroBUS(TM)
  connectors:
  - id: C1
    name: J7
    pins:
    - {id: 1, name: AN, pin_num: '14', pin_signal: PIO0_16/FC4_TXD_SCL_MISO_WS/CLKOUT/CT_INP4/SECURE_GPIO0_16/ADC0_8}
    - {id: 2, name: RST, pin_num: '32', pin_signal: RESETN}
    - {id: 3, name: CS, pin_num: '59', pin_signal: PIO1_1/FC3_RXD_SDA_MOSI_DATA/CT_INP3/SCT_GPI5/HS_SPI_SSEL1/USB1_OVERCURRENTN/PLU_OUT4}
    - {id: 4, name: SCK, pin_num: '61', pin_signal: PIO1_2/CAN0_TD/CTIMER0_MAT3/SCT_GPI6/HS_SPI_SCK/USB1_PORTPWRN/PLU_OUT5}
    - {id: 5, name: MISO, pin_num: '62', pin_signal: PIO1_3/CAN0_RD/SCT0_OUT4/HS_SPI_MISO/USB0_PORTPWRN/PLU_OUT6}
    - {id: 6, name: MOSI, pin_num: '60', pin_signal: PIO0_26/FC2_RXD_SDA_MOSI_DATA/CLKOUT/CT_INP14/SCT0_OUT5/USB0_IDVALUE/FC0_SCK/HS_SPI_MOSI/SECURE_GPIO0_26}
    - {id: 7, name: 3.3V, external_signal_types: power_supply_3.3V}
    - {id: 8, name: GND, external_signal_types: ground}
  - id: C2
    name: J8
    pins:
    - {id: 1, name: PWM, pin_num: '31', pin_signal: PIO1_5/FC0_RXD_SDA_MOSI_DATA/CTIMER2_MAT0/SCT_GPI0}
    - {id: 2, name: INT, pin_num: '64', pin_signal: PIO1_18/SCT0_OUT5/PLU_OUT0}
    - {id: 3, name: RX, pin_num: '3', pin_signal: PIO1_24/FC2_RXD_SDA_MOSI_DATA/SCT0_OUT1/FC3_SSEL3/PLU_OUT6}
    - {id: 4, name: TX, pin_num: '27', pin_signal: PIO0_27/FC2_TXD_SCL_MISO_WS/CTIMER3_MAT2/SCT0_OUT6/FC7_RXD_SDA_MOSI_DATA/PLU_OUT0/SECURE_GPIO0_27}
    - {id: 5, name: SCL, pin_num: '4', pin_signal: PIO1_20/FC7_RTS_SCL_SSEL1/CT_INP14/FC4_TXD_SCL_MISO_WS/PLU_OUT2}
    - {id: 6, name: SDA, pin_num: '30', pin_signal: PIO1_21/FC7_CTS_SDA_SSEL0/CTIMER3_MAT2/FC4_RXD_SDA_MOSI_DATA/PLU_OUT3}
    - {id: 7, name: 5V, external_signal_types: power_supply_5V}
    - {id: 8, name: GND, external_signal_types: ground}
pin_labels:
- {pin_num: '45', pin_signal: FB, label: FB}
- {pin_num: '48', pin_signal: LX, label: LX}
- {pin_num: '32', pin_signal: RESETN, label: 'SW2/J7[2]/J10[9]/J10[10]/U18[16]/N4M_RESET#', identifier: SW2;RESET}
- {pin_num: '96', pin_signal: USB0_3V3, label: VCC_3V3/USB0_FS}
- {pin_num: '98', pin_signal: USB0_DM, label: 'J3[2]/FS_USB0_DN', identifier: USB0_DM}
- {pin_num: '97', pin_signal: USB0_DP, label: 'J3[3]/FS_USB0_DP', identifier: USB0_DP}
- {pin_num: '99', pin_signal: USB0_VSS, label: GND}
- {pin_num: '38', pin_signal: USB1_3V3, label: VCC_3V3/USB1_HS}
- {pin_num: '35', pin_signal: USB1_DM, label: 'J4[2]/HS_USB1_DN', identifier: USB1_DM}
- {pin_num: '34', pin_signal: USB1_DP, label: 'J4[3]/HS_USB1_DP', identifier: USB1_DP}
- {pin_num: '36', pin_signal: USB1_VBUS, label: HS_USB_5V0/USB1_VBUS, identifier: USB1_VBUS}
- {pin_num: '33', pin_signal: USB1_VSS33, label: GND}
- {pin_num: '37', pin_signal: USB1_VSS37, label: GND}
- {pin_num: '49', pin_signal: VBAT_DCDC49, label: MCU_VBAT}
- {pin_num: '50', pin_signal: VBAT_DCDC50, label: MCU_VBAT}
- {pin_num: '51', pin_signal: VBAT_PMU, label: MCU_VBAT}
- {pin_num: '15', pin_signal: VDD15, label: 'JP20[2]/MCU_VDD'}
- {pin_num: '25', pin_signal: VDD25, label: 'JP20[2]/MCU_VDD'}
- {pin_num: '44', pin_signal: VDD44, label: 'JP20[2]/MCU_VDD'}
- {pin_num: '63', pin_signal: VDD63, label: 'JP20[2]/MCU_VDD'}
- {pin_num: '69', pin_signal: VDD69, label: 'JP20[2]/MCU_VDD'}
- {pin_num: '75', pin_signal: VDD75, label: 'JP20[2]/MCU_VDD'}
- {pin_num: '84', pin_signal: VDD84, label: 'JP20[2]/MCU_VDD'}
- {pin_num: '95', pin_signal: VDD95, label: 'JP20[2]/MCU_VDD'}
- {pin_num: '100', pin_signal: VDD100, label: 'JP20[2]/MCU_VDD'}
- {pin_num: '16', pin_signal: VDDA, label: 'JP21[2]/MCU_VDDA'}
- {pin_num: '39', pin_signal: VDD_PMU, label: VDD_PMU}
- {pin_num: '18', pin_signal: VREFN, label: 'JP5[1]/ADC_VREFN'}
- {pin_num: '17', pin_signal: VREFP, label: 'JP5[3]/ADC_VREFP'}
- {pin_num: '19', pin_signal: VSSA, label: GND}
- {pin_num: '46', pin_signal: VSS_DCDC46, label: GND}
- {pin_num: '47', pin_signal: VSS_DCDC47, label: GND}
- {pin_num: '28', pin_signal: XTAL32M_N, label: 'Y2[1]/XTAL32M_N'}
- {pin_num: '53', pin_signal: XTAL32K_N, label: 'Y3[1]/XTAL32K_N'}
- {pin_num: '29', pin_signal: XTAL32M_P, label: 'Y2[3]/XTAL32M_P'}
- {pin_num: '52', pin_signal: XTAL32K_P, label: 'Y3[2]/XTAL32K_P'}
- {pin_num: '54', pin_signal: PIO0_0/FC3_SCK/CTIMER0_MAT0/SCT_GPI0/SECURE_GPIO0_0/ACMP0_A, label: 'J11[2]/J13[5]/ARD_CMP0_IN_A'}
- {pin_num: '7', pin_signal: PIO0_1/FC3_CTS_SDA_SSEL0/CT_INP0/SCT_GPI1/CMP0_OUT/SECURE_GPIO0_1, label: 'J11[3]/J12[1]/EXP_CMP0_OUT'}
- {pin_num: '81', pin_signal: PIO0_2/FC3_TXD_SCL_MISO_WS/CT_INP1/SCT0_OUT0/SCT_GPI2/SECURE_GPIO0_2, label: 'J10[20]/U24[12]/FC3_SPI_MISO'}
- {pin_num: '83', pin_signal: PIO0_3/FC3_RXD_SDA_MOSI_DATA/CTIMER0_MAT1/SCT0_OUT1/SCT_GPI3/SECURE_GPIO0_3, label: 'J10[18]/U24[11]/FC3_SPI_MOSI'}
- {pin_num: '86', pin_signal: PIO0_4/CAN0_RD/FC4_SCK/CT_INP12/SCT_GPI4/FC3_CTS_SDA_SSEL0/SECURE_GPIO0_4, label: 'J10[16]/U24[14]/FC3_SPI_SSEL0'}
- {pin_num: '88', pin_signal: PIO0_5/CAN0_TD/FC4_RXD_SDA_MOSI_DATA/CTIMER3_MAT0/SCT_GPI5/FC3_RTS_SCL_SSEL1/MCLK/SECURE_GPIO0_5, label: 'J9[7]/J17[7]/J18[2]/SW4/JS3[1]/U22[11]/N4M_ISP_MODE',
  identifier: SW4;ISP}
- {pin_num: '89', pin_signal: PIO0_6/FC3_SCK/CT_INP13/CTIMER4_MAT0/SCT_GPI6/SECURE_GPIO0_6, label: 'J10[14]/U24[13]/FC3_SPI_SCK'}
- {pin_num: '6', pin_signal: PIO0_7/FC3_RTS_SCL_SSEL1/FC5_SCK/FC1_SCK/SECURE_GPIO0_7, label: J22/P0_7}
- {pin_num: '26', pin_signal: PIO0_8/FC3_SSEL3/FC5_RXD_SDA_MOSI_DATA/SWO/SECURE_GPIO0_8, label: J23/PIO0_8}
- {pin_num: '55', pin_signal: PIO0_9/FC3_SSEL2/FC5_TXD_SCL_MISO_WS/SECURE_GPIO0_9/ACMP0_B, label: J24/PI00_9}
- {pin_num: '21', pin_signal: PIO0_10/FC6_SCK/CT_INP10/CTIMER2_MAT0/FC1_TXD_SCL_MISO_WS/SCT0_OUT2/SWO/SECURE_GPIO0_10/ADC0_1, label: 'J9[1]/U18[12]/N4M_SWO', identifier: DEBUG_SWD_SWO}
- {pin_num: '13', pin_signal: PIO0_11/FC6_RXD_SDA_MOSI_DATA/CTIMER2_MAT2/FREQME_GPIO_CLK_A/SWCLK/SECURE_GPIO0_11/ADC0_9, label: 'J10[8]/U18[4]/N4M_SWDCLK', identifier: DEBUG_SWD_SWDCLK}
- {pin_num: '12', pin_signal: PIO0_12/FC3_TXD_SCL_MISO_WS/FREQME_GPIO_CLK_B/SCT_GPI7/SWDIO/FC6_TXD_SCL_MISO_WS/SECURE_GPIO0_12/ADC0_10, label: 'J10[6]/U18[8]/N4M_SWDIO',
  identifier: DEBUG_SWD_SWDIO}
- {pin_num: '71', pin_signal: PIO0_13/FC1_CTS_SDA_SSEL0/UTICK_CAP0/CT_INP0/SCT_GPI0/FC1_RXD_SDA_MOSI_DATA/PLU_IN0/SECURE_GPIO0_13, label: 'J13[9]/J13[10]/J18[8]/JS5[2]/FC1_I2C_SDA'}
- {pin_num: '72', pin_signal: PIO0_14/FC1_RTS_SCL_SSEL1/UTICK_CAP1/CT_INP1/SCT_GPI1/FC1_TXD_SCL_MISO_WS/PLU_IN1/SECURE_GPIO0_14, label: 'J13[11]/J13[12]/J18[6]/JS4[2]/FC1_I2C_SCL'}
- {pin_num: '22', pin_signal: PIO0_15/FC6_CTS_SDA_SSEL0/UTICK_CAP2/CT_INP16/SCT0_OUT2/SECURE_GPIO0_15/ADC0_2, label: 'J12[12]/ARD_INT_P0_15'}
- {pin_num: '14', pin_signal: PIO0_16/FC4_TXD_SCL_MISO_WS/CLKOUT/CT_INP4/SECURE_GPIO0_16/ADC0_8, label: 'J7[1]/J13[1]/JP4[1]/ARD_MIK_ADC0_8_N'}
- {pin_num: '8', pin_signal: PIO0_17/FC4_SSEL2/SCT_GPI7/SCT0_OUT0/PLU_IN2/SECURE_GPIO0_17, label: J25/P0_17}
- {pin_num: '56', pin_signal: PIO0_18/FC4_CTS_SDA_SSEL0/CTIMER1_MAT0/SCT0_OUT1/PLU_IN3/SECURE_GPIO0_18/ACMP0_C, label: 'J11[1]/J12[19]/EXP_CMP0_IN_C'}
- {pin_num: '90', pin_signal: PIO0_19/FC4_RTS_SCL_SSEL1/UTICK_CAP0/CTIMER0_MAT2/SCT0_OUT2/FC7_TXD_SCL_MISO_WS/PLU_IN4/SECURE_GPIO0_19, label: 'U13[30]/J9[11]/FC7_I2S_WS',
  identifier: FC7_I2S_WS}
- {pin_num: '74', pin_signal: PIO0_20/FC3_CTS_SDA_SSEL0/CTIMER1_MAT1/CT_INP15/SCT_GPI2/FC7_RXD_SDA_MOSI_DATA/HS_SPI_SSEL0/PLU_IN5/SECURE_GPIO0_20/FC4_TXD_SCL_MISO_WS,
  label: 'J19[2]/J9[9]/FC7_I2S_TX', identifier: FC7_I2S_TX}
- {pin_num: '76', pin_signal: PIO0_21/FC3_RTS_SCL_SSEL1/UTICK_CAP3/CTIMER3_MAT3/SCT_GPI3/FC7_SCK/HS_SPI_SSEL3/PLU_CLKIN/SECURE_GPIO0_21, label: 'U13[29]/J9[13]/FC7_I2S_BCLK',
  identifier: FC7_I2S_BCLK}
- {pin_num: '78', pin_signal: PIO0_22/FC6_TXD_SCL_MISO_WS/UTICK_CAP1/CT_INP15/SCT0_OUT3/USB0_VBUS/PLU_OUT7/SECURE_GPIO0_22, label: USB0_VBUS, identifier: USB0_VBUS}
- {pin_num: '20', pin_signal: PIO0_23/MCLK/CTIMER1_MAT2/CTIMER3_MAT3/SCT0_OUT4/FC0_CTS_SDA_SSEL0/SECURE_GPIO0_23/ADC0_0, label: 'J13[3]/JP4[3]/ARD_ADC0_0_P'}
- {pin_num: '70', pin_signal: PIO0_24/FC0_RXD_SDA_MOSI_DATA/CT_INP8/SCT_GPI0/SECURE_GPIO0_24, label: J26/P0_24}
- {pin_num: '79', pin_signal: PIO0_25/FC0_TXD_SCL_MISO_WS/CT_INP9/SCT_GPI1/SECURE_GPIO0_25, label: J27/P0_25}
- {pin_num: '60', pin_signal: PIO0_26/FC2_RXD_SDA_MOSI_DATA/CLKOUT/CT_INP14/SCT0_OUT5/USB0_IDVALUE/FC0_SCK/HS_SPI_MOSI/SECURE_GPIO0_26, label: 'J7[6]/J9[14]/ARD_MIK_HSSPI_MOSI'}
- {pin_num: '27', pin_signal: PIO0_27/FC2_TXD_SCL_MISO_WS/CTIMER3_MAT2/SCT0_OUT6/FC7_RXD_SDA_MOSI_DATA/PLU_OUT0/SECURE_GPIO0_27, label: 'J8[4]/J12[14]/ARD_MIK_FC2_USART_TXD'}
